```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_firebase_android_app.debug will be created
  + resource "google_firebase_android_app" "debug" {
      + api_key_id      = (known after apply)
      + app_id          = (known after apply)
      + deletion_policy = "DELETE"
      + display_name    = "Playground Debug"
      + etag            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + package_name    = "io.ashdavies.playground.debug"
      + project         = "playground-1a136"
      + sha1_hashes     = [
          + "2f50f8fd822a6592508b5adb58a231c729d616a3",
        ]
      + sha256_hashes   = [
          + "2ebfd15ae4682189f047b61a4faa903dc330cbf29b3a21f667595a73fb53a1ff",
        ]
    }

  # google_firebase_android_app.release will be created
  + resource "google_firebase_android_app" "release" {
      + api_key_id      = (known after apply)
      + app_id          = (known after apply)
      + deletion_policy = "DELETE"
      + display_name    = "Playground Release"
      + etag            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + package_name    = "io.ashdavies.playground"
      + project         = "playground-1a136"
      + sha1_hashes     = [
          + "a75f572e40a926bb1708178c134a1e86faadaa09",
        ]
      + sha256_hashes   = [
          + "0442b951b2d82cb339a7e4ef9469e71e89b182c7be5efb119f587cc2b19995bc",
        ]
    }

  # module.github-repository.github_actions_secret.main["firebase_android_app_id"] will be created
  + resource "github_actions_secret" "main" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "playground.ashdavies.dev"
      + secret_name     = "firebase_android_app_id"
      + updated_at      = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
<!-- thollander/actions-comment-pull-request "terraform-plan" -->